{
  "products": [
    {
      "id": 1,
      "name": "Red Dead Redemption 2",
      "desc": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. The game is the third entry in the Red Dead series and is a prequel to the 2010 game Red Dead Redemption. The story is set in 1899 and follows the exploits of outlaw Arthur Morgan, a member of the Van der Linde gang, in a fictionalized representation of the Western, Midwestern, and Southern United States. Arthur must deal with the decline of the Wild West whilst attempting to survive against government forces, rival gangs, and other adversaries.",
      "price": 3999,
      "platform": "PS4,Xbox One,Microsoft Windows",
      "image": "https://static.tvtropes.org/pmwiki/pub/images/rdr2.png"
    },
    {
      "id": 2,
      "name": "Tom Clancy's Rainbow Six: Extraction",
      "desc": "Tom Clancy's Rainbow Six Extraction (originally known as Tom Clancy's Rainbow Six Quarantine) is an upcoming multiplayer tactical shooter developed by Ubisoft Montreal and published by Ubisoft. A spin-off of Rainbow Six Siege (2015), Extraction is a cooperative multiplayer game in which players must work together to combat and defeat a type of parasite-like aliens called the Archaeans.",
      "price": 2999 ,
      "platform":"PS4,PS5,Xbox One,Xbox Series X and Series S,Microsoft Windows",
      "image": "https://i.redd.it/p13i4pg96i571.jpg"
    },
    {
      "id": 3,
      "name": "FIFA 22",
      "desc": "FIFA 22 is a football simulation video game published by Electronic Arts as part of the FIFA series. It is the 29th installment in the FIFA series, and was released worldwide on 1 October 2021, EA SPORTS™ FIFA 22 brings the game even closer to the real thing",
      "price": 4049,
      "platform": "PS4,PS5,Xbox One,Xbox Series X/S,Microsoft Windows,Nintendo Switch",
      "image": "https://static.wikia.nocookie.net/fifa/images/6/6c/FIFA_22_Cover.jpg"
    },
    {
      "id": 4,
      "name": "Dying Light 2:Stay human",
      "desc": "Dying Light 2 Stay Human is an upcoming action role-playing game developed and published by Techland. The sequel to 2015's Dying Light, the game participates in the life of a city engulfed in a new dark era.",
      "price": 3999,
      "platform": "PS4,PS5,Xbox One,Xbox Series X and Series S,Microsoft Windows",
      "image": "https://m.media-amazon.com/images/M/MV5BZTg4NGUxZWMtNmU3OC00YTNmLTkwYWMtYjE3OWQ4ODY3ODBhXkEyXkFqcGdeQXVyMzY0MTE3NzU@._V1_.jpg"
    },
    {
      "id": 5,
      "name": "Assassin’s Creed Valhalla",
      "desc": "Assassin's Creed Valhalla is a 2020 action role-playing video game developed by Ubisoft Montreal and published by Ubisoft. It is the twelfth major installment in the Assassin's Creed series, and the successor to 2018's Assassin's Creed Odyssey,In the game, you are Eivor, a fierce Viking warrior raised on tales of battle and glory. ",
      "price": 2499,
      "platform": "PS4,PS5,Xbox One,Xbox Series X and Series S,Microsoft Windows",
      "image": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Portrait_640x854-640x854-288120c5573756cb988b6c1968cebd86.png"
    },
    {
      "id": 6,
      "name": "Cyberpunk 2077",
      "desc": "Cyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification.",
      "price": 2999,
      "platform": "PS4,PS5,Xbox One,Xbox Series X and Series S,Microsoft Windows",
      "image": "https://muropaketti.com/wp-content/uploads/2020/12/cyberpunk-box.jpg"
    },
    {
      "id": 7,
      "name": "Far Cry 6",
      "desc": "Far Cry 6 is a 2021 action-adventure first-person shooter game developed by Ubisoft Toronto and published by Ubisoft. It is the sixth main installment in the Far Cry series and the successor to 2018's Far Cry 5. Fight against Anton's troops in the largest Far Cry playground to date ",
      "price": 3999,
      "platform": "PS4,PS5,Xbox One,Xbox Series X and Series S,Microsoft Windows",
      "image":"https://cdn1.epicgames.com/b4565296c22549e4830c13bc7506642d/offer/TETRA_PREORDER_STANDARD%20EDITION_EPIC_Store_Portrait_1200x1600-1200x1600-ca8b802ff13813c37a44ebf68d0946a2.png"
    },
    {
      "id": 8,
      "name": "God of War Ragnarök",
      "desc": "God of War Ragnarök is an upcoming action-adventure game developed by Santa Monica Studio and will be published by Sony Interactive Entertainment.Taking place three years after events of the previous game, Fimbulwinter is drawing to a close, and it is prophesied that Ragnarök will begin once it comes to an end.",
      "price": 4999,
      "platform": "PS4,PS5",
      "image": "https://s1.gaming-cdn.com/images/products/9312/271x377/god-of-war-ragnarok-ps5-playstation-5-game-playstation-store-cover.jpg"
    },
    {
      "id": 10,
      "name": "Watch Dogs: Legion",
      "desc": "Watch Dogs: Legion is a 2020 action-adventure game developed by Ubisoft Toronto and published by Ubisoft. It is the third instalment in the Watch Dogs series and the sequel to 2016's Watch Dogs 2.",
      "price": 3999,
      "platform": "PS4,PS5,Xbox One,Xbox Series X and Series S,Microsoft Windows",
      "image": "https://cdn1.epicgames.com/0a84818055e740a7be21a2e5b6162703/offer/WatchDogs_Legion_Store_Portrait_1200x1600-1200x1600-a6b2d4cce489aeeb87bad4a6db168bed.jpg"
    }
  ]
}